#pragma once
#include <iostream>
#ifdef _WIN32
# include <windows.h>
# undef min
# undef max
#endif


// This file contains the ASCII art logo for the project, which is printed to the console at startup.
void printLogo()
{
#ifdef _WIN32
	SetConsoleOutputCP(CP_UTF8);
	SetConsoleCP(CP_UTF8);
#endif // _WIN32

	std::cout << "  KETCAT AB INITIO NEUTRAL ATOM QUANTUM COMPUTER SIMULATOR v3.0     ░░                       " << std::endl;
	std::cout << "  ░░▒▓▓▓                                                            ▓█▓░                     " << std::endl;
	std::cout << "  ░▓███▓                                                            ▓██▓▒                    " << std::endl;
	std::cout << "  ░▓███▓                                                            ▓████▓░                  " << std::endl;
	std::cout << "  ░▓███▓    ░▓███▒░░                                      ░▒▓███▒░  ▓██████░                 " << std::endl;
	std::cout << "  ░▓███▓    ░▓█░░▓████▓░                             ░▒▓███▓▒ ░▓▓░  ▓███████▓░               " << std::endl;
	std::cout << "  ░▓███▓    ░▓▓░██▒░ ░▓████▒░                    ░▒███▓▒░ ░▒█▓▒▓▓░   ░████████▒░             " << std::endl;
	std::cout << "  ░▓███▓    ░▓█░████▓░   ░▓███▓░░ ░██▒▒░░░░░ ░░▓██▓▒    ░▓███▓▒▓▒░    ░▓███████▓░            " << std::endl;
	std::cout << "  ░▓███▓     ▒█░██████▓░     ░▓██▓▓█▓▒▓▓▓██████▓░     ░▓█████▓▒█▒░      ▒████████▒░          " << std::endl;
	std::cout << "  ░▓███▓     ▒█▒▓███▓▒▒█▓░    ░▓█▓░ ░░░       ░░    ░▓█▒░▓███▓▒█▒        ░▓███████▓░         " << std::endl;
	std::cout << "  ░▓███▓     ░▓▓░████▒░ ░▒  ░░▒▒▒▒▒▒░               ▒░  ▒████▒▓▓░          ░████████▓░       " << std::endl;
	std::cout << "  ░▓███▓      ▓█░▓█▒▓█▒░                              ░▒█▓░██░█▓░            ▒████████░      " << std::endl;
	std::cout << "  ░▓███▓      ░██░▓█▒░░░░                            ░░░ ▒██░▓▓░              ░▓███████▓░    " << std::endl;
	std::cout << "  ░▓███▓       ▒█▓░▓▓░                                  ░▒▓░▓█▒                ░▒████████▒   " << std::endl;
	std::cout << "  ░▓███▓        ▓█▓░ ░░░                              ░▒░ ▒▓█▓░                  ░▓███████▒  " << std::endl;
	std::cout << "  ░▓███▓       ▒██▒░   ░██▒                        ░██▓░   ░██▓                    ▒██████▒░ " << std::endl;
	std::cout << "  ░▓███▓   ░▓███▒░     ▓▓░░██▒                  ▒██░░▒▓░     ░████▒                 ░█████▒░ " << std::endl;
	std::cout << "  ░▓███▓    ▒██░       ▓▓ ▒▓░▒██░            ▒███░██ ▒▓░      ▒██▒                 ▒██████▒░ " << std::endl;
	std::cout << "  ░▓███▓   ░░▒██▓      ▒▓ ░████████▒▒▓  ░░░████████▒░▒▓     ░▒██▓░░              ░▓███████▒  " << std::endl;
	std::cout << "  ░▓███▓   ░██▒░        ▓█░░▓███▓░ ░░    ░▓ ░▓████░░▒▓░       ░▒██░            ░▒███████▓░   " << std::endl;
	std::cout << "  ░▓███▓     ▒▓██▒░       ▒▓▓░░░▒░          ░▒░░░▓▓▓░       ▒██▓▒░            ░▓███████▓░    " << std::endl;
	std::cout << "  ░▓███▓      ░▒█▓░   ░░░           ░▒██▓░            ░░    ▒█▓░            ░▒███████▓░      " << std::endl;
	std::cout << "  ░▓███▓      ░▓████▓▒░░░░░░          ▒▒░          ░░░░░▒▓████▓░           ▒████████▒        " << std::endl;
	std::cout << "  ░▓███▓     ░░░  ░▓██▓▒▒▒▒░        ▒▓▒▒▓▒        ░░▒▒▓▓▓█▓▒  ░░░        ░▓███████▓░         " << std::endl;
	std::cout << "  ░▓███▓        ░░░░░▒▓██▓▒░                      ░▒▓██▓▒░░░░░░         ▒████████▒░          " << std::endl;
	std::cout << "  ░▓███▓               ░░▒▓███▓▓▒░          ░▒▓▓████▒░░               ░▓███████▓░            " << std::endl;
	std::cout << "  ░▓███▓                   ░░░▒▓██████▓▓██████▓▒░░░                  ▒████████▒              " << std::endl;
	std::cout << "  ░▓███▓                          ░░░░░░░░░░                        ▒███████▓░               " << std::endl;
	std::cout << "  ░▓███▓                                                            ▓██████░                 " << std::endl;
	std::cout << "  ░▓███▓                                                            ▓████▒░                  " << std::endl;
	std::cout << "  ░▓███▓                                                            ▓██▓░                    " << std::endl;
	std::cout << "  ░▓███▓                                                            ▓█▒░                     " << std::endl;
	std::cout << "  ░▓▓▒░                                                             ░░                       " << std::endl;
	std::cout << "                                                                                             " << std::endl;
	std::cout << "                                                                                             " << std::endl;
}
